Tekla Open API Reference for Tekla Structures 2025
DetailMark.Attributes Property
 The attributes for the detail mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailMark.DetailMarkAttributes Attributes { get; set; }
Public Property Attributes As DetailMark.DetailMarkAttributes
	Get
	Set
Property Value
Type: DetailMark.DetailMarkAttributes
See Also
Reference
DetailMark Class
Tekla.Structures.Drawing Namespace